Revit 2026 API

# WireframeBuilderValidatePoint Method

---

Validates the point object to be added to the wireframe shape being constructed. Used by AddPoint() to validate input.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool ValidatePoint(
	Point GPoint
)
```
```vb
Public Shared Function ValidatePoint (
	GPoint As Point
) As Boolean
```
```cpp
public:
static bool ValidatePoint(
	Point^ GPoint
)
```
```fsharp
static member ValidatePoint :
        GPoint : Point -> bool
```

#### Parameters

GPoint Point
     Point object to be validated.

#### Return Value

Boolean True is %GPoint% is acceptable as a part of a wireframe shape representation being built.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

This function may be used to pre-validate the geometry being added to avoid an exception from AddPoint().

#### Reference

WireframeBuilder Class

Autodesk.Revit.DB Namespace